app/helpers/sessions_helper.rb

  def current_user
    logger.debug("SessionsHelper.current_user")
    logger.debug(session[:user_id])
    return unless (user_id = session[:user_id])
    @current_user ||= User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1