app/controllers/sessions_controller.rb

INSERT INTO `users` (`name`, `email`, `image`, `created_at`, `updated_at`) VALUES ('へいほー', 'heiho.developer@gmail.com', 'https://lh3.googleusercontent.com/a-/AOh14GhyiC82y3fufToJSObso8_dCIjMw-4urlI9B_4=s96-c', '2021-07-03 12:11:58.968538', '2021-07-03 12:11:58.968538')
---
  def create
    logger.debug("SessionsController.create")
    if (user = User.find_or_create_from_auth_hash(auth_hash))